tap "homebrew/services"
tap "zitadel/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Symlink farm manager
brew "stow"
# Cross-platform make
brew "cmake"
# More intuitive version of du in rust
brew "dust"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Language Server for the Lua language
brew "lua-language-server"
# Utility for directing compilation
brew "make"
# Ultra relevant, instant and typo-tolerant full-text search API
brew "meilisearch", restart_service: :changed
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Object-relational database system
brew "postgresql@16", restart_service: :changed, link: true
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line Interface for Scaleway
brew "tealdeer"
# Enables extra languages support for Tesseract
brew "tmux"
# Tmux session manager. Built on libtmux
brew "tmuxp"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# App to build and share containerised applications and microservices
cask "docker"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop automation application
cask "hammerspoon"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gitlab.gitlab-workflow"
vscode "grapecity.gc-excelviewer"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "rogalmic.zsh-debug"
