tap "homebrew/services"
tap "minio/stable"
tap "oven-sh/bun"
tap "vjeantet/tap"
tap "zitadel/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# JavaScript runtime, used by stay-alert
brew "oven-sh/bun/bun"
# Symlink farm manager
brew "stow"
# Cross-platform make
brew "cmake"
# Imagemagick for image manipulation
brew "imagemagick"
# More intuitive version of du in rust
brew "dust"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GNU debugger
brew "gdb"
# Distributed version control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Language Server for the Lua language
brew "lua-language-server"
# Utility for directing compilation
brew "make"
# Ultra relevant, instant and typo-tolerant full-text search API
brew "meilisearch", restart_service: :changed
# MinIO client / server
brew "minio/stable/mc"
brew "minio/stable/minio"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# OCR a PDF and add a searchable text layer
brew "ocrmypdf"
# Run large language models locally (CLI; companion to the cask)
brew "ollama"
# Open source for AI agents
brew "opencode"
# Search PDFs for patterns
brew "pdfgrep"
# Fast, disk-space-efficient package manager for Node
brew "pnpm"
# Object-relational database system
brew "postgresql@16", restart_service: :changed, link: true
# Protocol Buffers compiler
brew "protobuf"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Rsync for cloud storage
brew "rclone"
# In-memory data store
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Software construction tool
brew "scons"
# Command-line Interface for Scaleway
brew "scw"
# OCR engine with extra language packs
brew "tesseract-lang"
# Terminal multiplexer
brew "tmux"
# Tmux session manager built on libtmux
brew "tmuxp"
# Native notification CLI used by some scripts
brew "vjeantet/tap/alerter"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Docker Desktop (cask was renamed from `docker` to `docker-desktop`)
cask "docker-desktop"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Tailscale client for secure remote access (renamed from `tailscale`)
cask "tailscale-app"
# Desktop automation application
cask "hammerspoon"
# LaTeX distribution (smaller alternative to MacTeX)
cask "basictex"
# Gemini desktop app
cask "gemini"
# Secure tunnels to localhost
cask "ngrok"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "gitlab.gitlab-workflow"
vscode "grapecity.gc-excelviewer"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "rogalmic.zsh-debug"
